# Panda Import

In [1]:
import pandas as pd

## Create DataFrame

In [2]:
dict1 ={'Name':['Rohit','Rani','Sana','Abhay','Rishub',
                'Marry','Manisha'],
                'Marks':[98,89,99,87,90,83,99],
                'Gender':['Male','Female','Female','Male','Male',
                         'Female','Female']
               }
df1=pd.DataFrame(dict1)
df1

      Name  Marks  Gender
0    Rohit     98    Male
1     Rani     89  Female
2     Sana     99  Female
3    Abhay     87    Male
4   Rishub     90    Male
5    Marry     83  Female
6  Manisha     99  Female

In [3]:
df1

      Name  Marks  Gender
0    Rohit     98    Male
1     Rani     89  Female
2     Sana     99  Female
3    Abhay     87    Male
4   Rishub     90    Male
5    Marry     83  Female
6  Manisha     99  Female

### 1. Display the top 3 Rows of the Dataset.

In [61]:
df1.head(3)

    Name  Marks  Gender
0  Rohit     98    Male
1   Rani     89  Female
2   Sana     99  Female

### 2.Display the last 3 Rows of the Dataset.

In [5]:
df1.tail(3)

      Name  Marks  Gender
4   Rishub     90    Male
5    Marry     83  Female
6  Manisha     99  Female

### 3. Find Shape of Our Dataset (Number of Rows and Number of the Columns)

In [6]:
df1.shape

(7, 3)

In [7]:
print('number of rows',df1.shape[0])
print('number of colums',df1.shape[1])

number of rows 7
number of colums 3

### 4. Get Overall Statistics About The Dataframe

In [8]:
df1.describe()

           Marks
count   7.000000
mean   92.142857
std     6.491753
min    83.000000
25%    88.000000
50%    90.000000
75%    98.500000
max    99.000000

### 5. Get Information About Our Dataset Like Total Number Rows, Total Number of Columns, Datatypes of Each Column And Memory Requirement

In [9]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 296.0+ bytes

### 6.Check Null Values In The Dataset

In [10]:
df1.isnull().sum().sum()

0

### 7.Find Unique Values From The Gender Column

In [11]:
df1['Gender'].unique()

array(['Male', 'Female'], dtype=object)

### 8.Find the Number of Unique values from the Gender column

In [12]:
df1['Gender'].nunique()

2

### 9.Display Count of Unique Values In Gender Column

In [13]:
df1['Gender'].value_counts()

Female    4
Male      3
Name: Gender, dtype: int64

### 10.Find total Number of students Maving Marks Between 90 to 100 (Inclusive) Using Between Method

In [14]:
df1[df1['Marks']>=90]

      Name  Marks  Gender
0    Rohit     98    Male
2     Sana     99  Female
4   Rishub     90    Male
6  Manisha     99  Female

In [15]:
len(df1[(df1['Marks']>=90) & (df1['Marks']<=100)] )

4

In [16]:
sum(df1['Marks'].between(90,100))

4

### 11.Find Average Marks

In [17]:
df1['Marks'].mean()

92.14285714285714

In [18]:
def makrs(x):
    return x//2

### 12.Apply Method

In [19]:
df1['Half']=df1['Marks'].apply(makrs)

In [20]:
df1

      Name  Marks  Gender  Half
0    Rohit     98    Male    49
1     Rani     89  Female    44
2     Sana     99  Female    49
3    Abhay     87    Male    43
4   Rishub     90    Male    45
5    Marry     83  Female    41
6  Manisha     99  Female    49

In [21]:
df1['Marks'].apply(lambda y:y//2)

0    49
1    44
2    49
3    43
4    45
5    41
6    49
Name: Marks, dtype: int64

In [22]:
df1['Name'].apply(len)

0    5
1    4
2    4
3    5
4    6
5    5
6    7
Name: Name, dtype: int64

### 13.Map Function

In [27]:
df1['MALE']=df1['Gender'].map({'Male':1,'Female':0})

In [28]:
df1

      Name  Marks  Gender  Half  MALE
0    Rohit     98    Male    49     1
1     Rani     89  Female    44     0
2     Sana     99  Female    49     0
3    Abhay     87    Male    43     1
4   Rishub     90    Male    45     1
5    Marry     83  Female    41     0
6  Manisha     99  Female    49     0

### 14.Drop the Columns

In [30]:
df1.drop('MALE',axis=1)

      Name  Marks  Gender  Half
0    Rohit     98    Male    49
1     Rani     89  Female    44
2     Sana     99  Female    49
3    Abhay     87    Male    43
4   Rishub     90    Male    45
5    Marry     83  Female    41
6  Manisha     99  Female    49

In [37]:
df1.drop(['Half','MALE'],axis=1,inplace=True)

In [38]:
df1

      Name  Marks  Gender
0    Rohit     98    Male
1     Rani     89  Female
2     Sana     99  Female
3    Abhay     87    Male
4   Rishub     90    Male
5    Marry     83  Female
6  Manisha     99  Female

### 15.Print Name of the Columns

In [40]:
df1.columns

Index(['Name', 'Marks', 'Gender'], dtype='object')

In [42]:
df1.index

RangeIndex(start=0, stop=7, step=1)

### 16.Sort the Datafram As per the marks Columns

In [48]:
df1.sort_values(by='Marks',ascending=False)

      Name  Marks  Gender
2     Sana     99  Female
6  Manisha     99  Female
0    Rohit     98    Male
4   Rishub     90    Male
1     Rani     89  Female
3    Abhay     87    Male
5    Marry     83  Female

In [49]:
df1

      Name  Marks  Gender
0    Rohit     98    Male
1     Rani     89  Female
2     Sana     99  Female
3    Abhay     87    Male
4   Rishub     90    Male
5    Marry     83  Female
6  Manisha     99  Female

### 17.Display Name & Marks of The Female Students

In [55]:
df1[df1['Gender']=='Female'][['Name','Marks']]

      Name  Marks
1     Rani     89
2     Sana     99
5    Marry     83
6  Manisha     99

In [59]:
df1[df1['Gender'].isin(['Female'])][['Name','Marks']]

      Name  Marks
1     Rani     89
2     Sana     99
5    Marry     83
6  Manisha     99